Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes Constructor (Vector, TagLocation, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location and content.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkBasicTagAttributes(
	Vector offset,
	TagLocation location,
	ContainerElement tagContent
)
Public Sub New (
	offset As Vector,
	location As TagLocation,
	tagContent As ContainerElement
)
Parameters
offset
Type: Tekla.Structures.Geometry3d.Vector
The offset of the mark tag to be used.
location
Type: Tekla.Structures.Drawing.TagLocation
The location of the mark tag to be used.
tagContent
Type: Tekla.Structures.Drawing.ContainerElement
The content of the mark tag to be used.
See Also
Reference
ViewMarkBasicTagAttributes Class
ViewMarkBasicTagAttributes Overload
Tekla.Structures.Drawing Namespace